print("""
n школярів ділять k яблук порівну, залишок, що не ділиться, залишається в кошику.
Скільки яблук дістанеться кожному школяру? 
Скільки яблук залишиться у кошику? 
Програма отримує на вхід числа n і k і повинна вивести кількість яблук (два числа).
""")
n = int(input("Введіть кількість учнів: "))
k = int(input("Введіть кільіксть яблук: "))
for_student = 0
basket = 0
if k < n:
    print("Яблук не вистачить на всіх :(")
elif k % n == 0:
    for_student = k//n
    basket = 0
    print(f"Кількість яблук в кожного учня: {for_student}")
    print(f"Кількість яблук в кошику: {basket}")
else:
    for_student = k // n
    basket = k % n
    print(f"Кількість яблук в кожного учня: {for_student}")
    print(f"Кількість яблук в кошику: {basket}")
